# 06_index/column_설정하기

In [1]:
import pandas as pd

In [2]:
liverpool_df = pd.read_csv('data/liverpool.csv', index_col = 0)
liverpool_df

                position  born  number nationality
Roberto Firmino       FW  1991   no. 9      Brazil
Sadio Mane            FW  1992  no. 10     Senegal
Mohamed Salah         FW  1992  no. 11       Egypt
Joe Gomez             DF  1997  no. 12     England
Alisson Becker        GK  1992  no. 13      Brazil

column 의 맨앞글자만 대문자로 만들어보자

In [3]:
liverpool_df.rename(columns={'position':'Position'})

                Position  born  number nationality
Roberto Firmino       FW  1991   no. 9      Brazil
Sadio Mane            FW  1992  no. 10     Senegal
Mohamed Salah         FW  1992  no. 11       Egypt
Joe Gomez             DF  1997  no. 12     England
Alisson Becker        GK  1992  no. 13      Brazil

오 잘바뀌었다 원본 liverpool_df를 출력해보자

In [4]:
liverpool_df

                position  born  number nationality
Roberto Firmino       FW  1991   no. 9      Brazil
Sadio Mane            FW  1992  no. 10     Senegal
Mohamed Salah         FW  1992  no. 11       Egypt
Joe Gomez             DF  1997  no. 12     England
Alisson Becker        GK  1992  no. 13      Brazil

바뀌지 않고 그대로다 왜그런걸까?

Dataframe.rename함수는 원본을 바꿔주는게아니라 바뀐결과값으로 새로운 DataFrame을 반환해준다

그렇다면 어케 바꿀수 있는가?

In [7]:
liverpool_df.rename(columns={'position':'Position'},inplace=True)

DataFrame.rename 모듈에 inplace = True 인자를 추가하여 사용한다

In [6]:
liverpool_df

                Position  born  number nationality
Roberto Firmino       FW  1991   no. 9      Brazil
Sadio Mane            FW  1992  no. 10     Senegal
Mohamed Salah         FW  1992  no. 11       Egypt
Joe Gomez             DF  1997  no. 12     England
Alisson Becker        GK  1992  no. 13      Brazil

여러개 바꿔보자

In [10]:
liverpool_df.rename(columns={'born':'Born', 'number':'Number','nationality':'Nationality'},inplace=True)
liverpool_df

                Position  Born  Number Nationality
Roberto Firmino       FW  1991   no. 9      Brazil
Sadio Mane            FW  1992  no. 10     Senegal
Mohamed Salah         FW  1992  no. 11       Egypt
Joe Gomez             DF  1997  no. 12     England
Alisson Becker        GK  1992  no. 13      Brazil

열이름을 한번 여러개 바꿔보자

In [13]:
liverpool_df.rename(index={'Roberto Firmino':'ROBERTO FIRMINO','Sadio Mane':'SADIO MANE'}, inplace = True)
liverpool_df

                Position  Born  Number Nationality
ROBERTO FIRMINO       FW  1991   no. 9      Brazil
SADIO MANE            FW  1992  no. 10     Senegal
Mohamed Salah         FW  1992  no. 11       Egypt
Joe Gomez             DF  1997  no. 12     England
Alisson Becker        GK  1992  no. 13      Brazil

index에다가 설명도 붙여보자

In [15]:
liverpool_df.index.name = 'Player Name'
liverpool_df

                Position  Born  Number Nationality
Player Name
ROBERTO FIRMINO       FW  1991   no. 9      Brazil
SADIO MANE            FW  1992  no. 10     Senegal
Mohamed Salah         FW  1992  no. 11       Egypt
Joe Gomez             DF  1997  no. 12     England
Alisson Becker        GK  1992  no. 13      Brazil

혹시...칼럼에도 설명을 붙여줄수 있을까?

In [16]:
liverpool_df.columns.name = 'detail'

In [17]:
liverpool_df

detail          Position  Born  Number Nationality
Player Name
ROBERTO FIRMINO       FW  1991   no. 9      Brazil
SADIO MANE            FW  1992  no. 10     Senegal
Mohamed Salah         FW  1992  no. 11       Egypt
Joe Gomez             DF  1997  no. 12     England
Alisson Becker        GK  1992  no. 13      Brazil

옼ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ

인덱스 자체를 혹시 바꿔줄순 있을까?

예를들어 선수이름말고 등번호로 인덱스를 만들고싶다고 가정해보자 한번말해보자

In [26]:
liverpool_df.set_index('Number')

KeyError: "None of ['Number'] are in the columns"

근데 이름값이 없어지면 안되니 이름 인덱스는 미리 칼럼에 넣어 놓자

In [19]:
liverpool_df.index

Index(['ROBERTO FIRMINO', 'SADIO MANE', 'Mohamed Salah', 'Joe Gomez',
       'Alisson Becker'],
      dtype='object', name='Player Name')

In [20]:
liverpool_df['Player Name'] = liverpool_df.index

In [21]:
liverpool_df

detail          Position  Born  Number Nationality      Player Name
Player Name
ROBERTO FIRMINO       FW  1991   no. 9      Brazil  ROBERTO FIRMINO
SADIO MANE            FW  1992  no. 10     Senegal       SADIO MANE
Mohamed Salah         FW  1992  no. 11       Egypt    Mohamed Salah
Joe Gomez             DF  1997  no. 12     England        Joe Gomez
Alisson Becker        GK  1992  no. 13      Brazil   Alisson Becker

In [22]:
liverpool_df.set_index('Number')

detail Position  Born Nationality      Player Name
Number
no. 9        FW  1991      Brazil  ROBERTO FIRMINO
no. 10       FW  1992     Senegal       SADIO MANE
no. 11       FW  1992       Egypt    Mohamed Salah
no. 12       DF  1997     England        Joe Gomez
no. 13       GK  1992      Brazil   Alisson Becker

In [23]:
liverpool_df

detail          Position  Born  Number Nationality      Player Name
Player Name
ROBERTO FIRMINO       FW  1991   no. 9      Brazil  ROBERTO FIRMINO
SADIO MANE            FW  1992  no. 10     Senegal       SADIO MANE
Mohamed Salah         FW  1992  no. 11       Egypt    Mohamed Salah
Joe Gomez             DF  1997  no. 12     England        Joe Gomez
Alisson Becker        GK  1992  no. 13      Brazil   Alisson Becker

In [24]:
liverpool_df.set_index('Number',inplace=True)

In [25]:
liverpool_df

detail Position  Born Nationality      Player Name
Number
no. 9        FW  1991      Brazil  ROBERTO FIRMINO
no. 10       FW  1992     Senegal       SADIO MANE
no. 11       FW  1992       Egypt    Mohamed Salah
no. 12       DF  1997     England        Joe Gomez
no. 13       GK  1992      Brazil   Alisson Becker